app/views/entries/_form.html.erb

SELECT "cats".* FROM "cats"
---
    <%= f.label "category" %><br />
    <%= collection_select(:entry, :cat_id, Cat.all, :id, :name)%>