app/controllers/cats_controller.rb

INSERT INTO "cats" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 11 Apr 2012 23:13:39 UTC +00:00], ["name", "Sport"], ["updated_at", Wed, 11 Apr 2012 23:13:39 UTC +00:00]]
---
  def create
    @cat = Cat.new(params[:cat])

    respond_to do |format|
      if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "cats" SET "name" = 'Technologies', "updated_at" = '2012-04-14 03:51:28.817709' WHERE "cats"."id" = 2
---
  def update
    @cat = Cat.find(params[:id])

    respond_to do |format|
      if @cat.update_attributes(params[:cat])