app/controllers/entries_controller.rb

  def index
    if params[:id]
      @entries = Entry.where(:cat_id => params[:id])
    else
      @entries = Entry.all
---
SELECT "entries".* FROM "entries" WHERE "entries"."cat_id" = 1
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 2]]

  def update_main
    @entry = Entry.find(params[:entrie_id])

    @entry.mainimg = params[:setmain]
    respond_to do |format|
      if @entry.save
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "entries" SET "mainimg" = 12, "updated_at" = '2012-04-13 22:21:51.252614' WHERE "entries"."id" = 2

  def show
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @entry = Entry.new
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def edit
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("cat_id", "created_at", "description", "mainimg", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cat_id", nil], ["created_at", Wed, 11 Apr 2012 23:11:16 UTC +00:00], ["description", nil], ["mainimg", nil], ["title", nil], ["updated_at", Wed, 11 Apr 2012 23:11:16 UTC +00:00]]

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "entries" SET "description" = 'adasdasd (se cambio a sport)', "cat_id" = 1, "updated_at" = '2012-04-11 23:30:01.886532' WHERE "entries"."id" = 3

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]