app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @image = Image.find(params[:id])

INSERT INTO "images" ("created_at", "entrie_id", "filename", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 11 Apr 2012 23:13:59 UTC +00:00], ["entrie_id", 1], ["filename", ""], ["title", "zarza"], ["updated_at", Wed, 11 Apr 2012 23:13:59 UTC +00:00]]
---
  def create
    @image = Image.new(params[:image])

    if (params[:image][:filename])
    #function in manage_images.rb
    process_image(tmp = params[:image][:filename].tempfile)
    end
    identrie = params[:image][:entrie_id]
    respond_to do |format|
      if @image.save

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image = Image.find(params[:id])

    imagen = @image.filename

    #function in manage_images.rb
    remove_image_file(imagen)

    @image.destroy