app/views/cats/_categories.html.erb

<% @categories = Cat.all %>
---
SELECT "cats".* FROM "cats"